app/Controllers/Home.php

    public function index()
    {

        $ServiceModel = new ServiceModel();
        $data['services'] = $ServiceModel->findAll();
---
SELECT *
FROM `tbl_service`